/* В задачі getDrinks ми допомогли ведучому порахувати, скільки потрібно випивки, щоб кожен гість
міг сказати тост. Конкурс людям сподобався, але ті гості, що прийшли раніше жалілися, що не можна стільки пити.

Тому ведучий вирішив трохи змінити правила. Молодята обирают число step і тепер тост промовляє
не кожен гість, а лише перший і кожен наступний, який приходить через обрану кількість гостей. Наприклад:

якщо step = 1, то, як і раніше, тост говорит кожен гість
якщо step = 2, то 1-ий, 3-ій, 5-ий ...
якщо step = 3, то 1, 4, 7, 10 ...
Напиши функцію getDrinksWithStep, яка приймає numberOfGuest і step та повертає
кількість чарок, яку треба підготувати для конкурса.

Як і раніше, для простоти пропоную використати цикл for, але з іншим кроком.

Приклади:

getDrinksWithStep(10, 3) === 22 (1 + 4 + 7 + 10);
getDrinksWithStep(0) === 0 нема гостей - нема випивки;
getDrinksWithStep(5, 3) === 5 (1 + 4);
getDrinksWithStep(18, 10) === 12 (1 + 11); */

debugger;
function getDrinksWithStep(numberOfGuests, step) {
  let numberOfDrinks = 0;
  for (let i = 1; i <= numberOfGuests; i += step) {   // збільшуємо i на step разів кожну ітерацію
    numberOfDrinks += i;
  }
  return numberOfDrinks;
}
console.log(getDrinksWithStep(34, 4));
