/* Всі ми любимо розважатись на весіллі. Одного разу тамада вирішив розважити гостей поки вони
збираються і встановив правило: як тільки приходить новий гість, всі п'ють разом за здоров'я молодят.

Давай допоможемо тамаді заздалегіть порахувати, скільки треба приготувати порцій випивки, щоб
нікому не довелося чекати, якщо він знає, скільки всього буде гостей.

Наприклад, якщо гостей будет троє, то знадобится:

1 порція, коли прийде перший гість
ще 2, коли прийде другий
і ще 3, коли прийде третій
Всього 1 + 2 + 3 = 6 порцій

Для простоти пропоную скористатися циклом for і, коли приходить наступний гість,
просто додавати те що випили зараз до того що випили раніше.

Приклади:

getDrinks(3) === 6 (1 + 2 + 3);
getDrinks(0) === 0 нема гостей - нема випивки;
getDrinks(5) === 15 (1 + 2 + 3 + 4 + 5);
 */

function getDrinks(numberOfGuests) {   /// numberOfGuest - кількість гостей , наприклад 3
  let numberOfDrinks = 0;              /// numberOfDrinks - кількість випивки, +1 гість = + 2 випивки
  for (let i = 1; i <= numberOfGuests; i++) {
    numberOfDrinks += i;   /// кількісь випивки = 0 + 1 при першій ітерації, при другій 1 + 2, при третій 3 + 3
  }
  return numberOfDrinks;
}

