/* Студент Сергій хоче купити Unlim підписку в Mate academy, але в нього не вистачає грошей.
Тому він звернувся в Mate bank, який видає кредити під 10% річних і дозволяє виплачувати тіло та
відсотки одним платежем в кінці строку.

Якщо брати 1600$ на 3 роки, то в кінці треба заплатити 2129.6$. Але Сергій планував вкластися в 2000.
Перерахувавши знову, банкір сказав, що Сергій може взяти кредит на 2 роки, тоді він заплатить лише 1936$.

1600 + 10% = 1760 (160$ відсотки за 1-ий рік)
1760 + 10% = 1936 (176$ відсотки за 2-ий рік)
Давай створимо функцію getYears, яка за розміром кредита amount, річним відсотком percent та
обмеженням клієнта limit обчислить максимальний термін кредита (ціла кількість років)

Приклади:

getYears(1600, 10, 2000) === 2 1600 + 160 + 176 < 2000;
getYears(500, 3, 550) === 3 */

function getYears(amount, percent, limit) { /// наприклад 1000 10 1500 
  let amountOfYears = 0;
  let profit = amount;   /// записуємо базову суму в нову змінну
  do {
    let percentage = profit * percent / 100; /// рахуємо %, 1 ітерація = 100, 2 ітерація 110, 3 ітерація 121, 4 ітерація 133.1 і так далі
    profit += percentage;      /// (тіло + %)= 1000+100=1100, 2 ітерація 1100+110=1210, 3 ітерація 1210+121=1331, 4 ітерація 1331+133.1=1464.1 і так далі
    if (profit <= limit) {                 /// первіряємо, чи заг. сума менша чи рівна ліміту
      amountOfYears++;                    /// якщо так, додамо +1 рік
    }
  }
  while (profit <= limit);                 /// виконуємо цикл, поки заг сума менша чи рівна ліміту

  return amountOfYears;
}
// --------- Розв'язок ментора!!!-----------

function getYears(amount, percent, limit) {
  let amountOfYears = 0;
  let profit = amount;

  while (profit <= limit) {
    amountOfYears++;
    profit += profit * percent / 100;
  }
  return amountOfYears - 1;
}