/* Готельна справа нелегка штука. Особливо в наші часи. Grand Mate Hotel оновив свій сайт для
бронювання номерів. Нарешті крім номера телефону готелю з'явилася і форма для бронювання.
У формі бронювання потрібно ввести кількість гостей. На жаль, програмісти зробили це поле текстовим
і тепер готель отримує результати у вигляді "1 гість", "3", "Я і моя мала", "Двійко гостей", "Десь 6".
Давай покращимо програмне забезпечення готелю і напишемо для них функцію getGuestsCount, котра буде
приймати рядок guestsInput та повертати число гостей. Якщо кількість гостей визначити неможливо -
повертатиме рядок not a number. 
Приклади:

getGuestsCount('Двоє') === 'not a number'
getGuestsCount('Я буду 1') === 'not a number'
getGuestsCount('3 людини') === 3 */

function getGuestsCount(guestsInput) {

  if (parseInt(guestsInput) >= 0) {
    return parseInt(guestsInput);
  } else {
    return 'not a number';
  }
}