/* На районній олімпіаді з інформатики, в розпал подій трапився казус. Сервер для визначення
переможця серед двох фіналістів Максима і Романа поламався. Він мав повертати кількість
задач яку розв'язав Максим та Роман у нашу функцію, котра вміє працювати тільки з числами.
Та щось пішло не так і сервер почав повертати як рядки так і числа в результаті вхідні дані
могли виглядати непередбачувано. Олімпіада на межі зриву. Давай швидко виправимо ситуацію і
допоможемо організаторам новою функцією getWinner, яка першим параметром приймає кількість
задач, які розв'язав Максим maxSolved, а другою кількість, яку розв'язав Роман romanSolved.
Вхідні параметри можуть бути як рядками, так і числами. Результатом функції буде рядок:

Max winner!!! - якщо Максим розв'язав більшу кількість задач;
Roman winner!!! - якщо Роман розв'язав більшу кількість задач;
Roman and Maxim are the winners!!! - якщо хлопці розв'язали однакову кількість задач.

Приклади:
getWinner(45, '42') === 'Max winner!!!'
getWinner('34', 35) === 'Roman winner!!!'
getWinner(24, 28) === 'Roman winner!!!'
getWinner('13', '11') === 'Max winner!!!'
getWinner(15, '15') === 'Roman and Maxim are the winners!!!' */

function getWinner(maxSolved, romanSolved) {
  let maxWin = +maxSolved;
  let romanWin = +romanSolved;
  if (maxWin > romanWin) {
    return 'Max winner!!!';
  } else if (maxWin < romanWin) {
    return 'Roman winner!!!';
  } else {
    return 'Roman and Maxim are the winners!!!';
  }
}