/* В нас є коробка зі шкарпетками декількох кольорів. Ми беремо з неї по 2 шкарпетки одного кольору і відкладаємо. Перша пара може бути червона, друга зелена, третя знов червона.

Напиши функцію countMatchingSocks, яка приймає массив чисел colors, де кожне число — це шкарпетка певного кольору, та повертає максимальну кількість пар (два однакових числа), яку можна забрати з коробки.

Приклади:

[10, 10] - одна пара шкарпеток кольору 10.
[2, 2, 2, 2, 2] - дві пари шкарпеток кольору 2.
[10, 20, 30, 40, 50, 60] - всі шкарпетки різних кольорів - 0 пар.
[10, 20, 30, 10, 20, 60] - 2 пари. Одна кольору 10 і одна кольору 20 */

function countMatchingSocks(colors) {
  const result = [];
  const sorted = colors.sort();

  for (let i = 0; i < sorted.length; i++) {
    if (sorted[i] === sorted[i + 1]) {
      result.push(sorted[i++]);
    }
  }

  return result.length;
}
