/* Наліпки готові? Добре, треба збільшити потужності наших ліній у два рази!
До цього ми там тільки попкорн готували.

Наші лінії керуються з сервера. На сервері є масив з теперішніми потужностями 
ліній currentPowers, напиши функцію doublePower, яка збільшить потужність кожної 
лінії на заводі у два рази.

Приклади:

doublePower([100, 150, 200, 220]) === [200, 300, 400, 440]
doublePower([45, 34, 56, 67]) === [90, 68, 112, 134]
doublePower([]) === [] */

function doublePower(currentPowers) {
  let value = currentPowers;
  for (let i = 0; i < value.length; i++) {
    value[i] = value[i] * 2;   // множення кожного елементу масива на 2
  }
  return value;
}