/* Напишіть функцію findSmallerDigits(arr), яка приймає масив чисел arr та повертає новий
масив чисел resultArr. Кожне число нового масиву resultArr[i] - це кількість 
чисел праворуч від arr[i], які менші за arr[i].

Наприклад:

findSmallerDigits([5, 4, 3, 2, 1]) === [4, 3, 2, 1, 0]
findSmallerDigits([1, 2, 0]) === [1, 1, 0]
findSmallerDigits([1, 1, -1, 0, 0]) === [3, 3, 0, 0, 0]
findSmallerDigits([5, 4, 7, 9, 2, 4, 4, 5, 6]) === [4, 1, 5, 5, 0, 0, 0, 0, 0] */

debugger;
function findSmallerDigits(arr) {   // arr = (9) [5, 4, 7, 9, 2, 4, 4, 5, 6]
  const resultArr = [];
  let counter = 0;

  for (let i = 0; i < arr.length; i++) {  // береться 0 індекс (5)
    for (let n = i; n < arr.length; n++) { // далі відбувається перебір всіх індексів з того ж масиву
      if (arr[n] < arr[i]) {  // де вони порівнюються з 0 індексом з першого циклу, тобто чи 5<5, 4<5, 7<5, 9<5
        counter += 1;        // якщо значення індекса другого цикла менше значення першого, то збільшуємо лічильник
      }
    }
    resultArr.push(counter); // додаємо в кінець масиву значення лічильника
    counter = 0;   // скидаємо лічильник
  }  // далі в першому циклі збільшуємо i, беремо 1 індекс (4) і після другого циклу починаємо порівнювати всі значення індексів, починаючи з 1- го
      // тобто 4<4, 7<4, 9<4, 2<4 і так далі
  return resultArr;
}
console.log(findSmallerDigits([5, 4, 7, 9, 2, 4, 4, 5, 6]))
