/* У Боба на столі лежать камені розміщені в ряд. Кожен з них може бути червоним, 
зеленим або синім і представлений символом R, G або B відповідно.

Допоможи Бобу знайти мінімальну кількість каменів, які він повинен прибрати 
зі столу, щоб після цього кожна пара каменів, що лежать поруч, містила камені різного кольору.

Приклади:

"RRGB" => 1
"RRGGB" => 2
"RRRRGB" => 3
"RGBRGBRGGB" => 1
"RGGRGBBRGRR" => 3
"RRRRGGGGBBBB" => 9 */

function colorStones(stones) {
  let counter = 0;
  let testStone = '';

  for (const stone of stones) {   // перебір посимвольно, stone: "R"
    if (stone === testStone) {   // під час 1 ітерації умова не виконається
      counter++;           // під час другої, якщо символ із перебору === символу із testStone, буде збільшено лічильник
    } // лічильник спрацює 3 рази
    testStone = stone;    // в testStone запишеться символ із stone(1 ітерація), на 5 ітерації сюди попаде G, на 6 B
  }
  return counter;
}
