/* На складах, порядок. Роботи стоять без роботи. Проведемо інвентаризацію?
На кожній коробці є 1 символ, що позначає її тип. Потрібно навчити роботів і рахувати їх.
Створи функцію countBoxes, яка приймає рядок boxes, де кожен символ - це тип однієї з 
коробок на складі. Порахуй, скільки коробок кожного типу є на складі та поверни об'єкт зі звітом.
Приклад:

countBoxes('aabca') === { a: 3, b: 1, c: 1 }
countBoxes('aaaaca31') === { a: 5, c: 1, 3: 1, 1: 1 }
countBoxes('') === {} */
debugger;
function countBoxes(boxes) {
  const obj = {};
  const arr = boxes.split('');  // arr = (8) ["a", "a", "a", "a", "c", "a", "3", "1"], boxes = "aaaaca31"
                                                                                                                         /* var arr = ["Яблоко", "Апельсин", "Груша"];
                                                                                                                            arr.forEach(function(item, i, arr) {
                                                                                                                            alert( i + ": " + item + " (массив:" + arr + ")" );
// arr.forEach(i => - перебираємо масив arr по параметру і, тобто індексу                                                                                                                          }); */
  arr.forEach(i => {               
                                  /* Метод «arr.forEach(callback[, thisArg])» используется для перебора массива.
                                      Он для каждого элемента массива вызывает функцию callback.                            0: Яблоко (массив:Яблоко,Апельсин,Груша)
                                      Этой функции он передаёт три параметра callback(item, i, arr):                        1: Апельсин (массив:Яблоко,Апельсин,Груша)
                                      item – очередной элемент массива.                                                     2: Груша (массив:Яблоко,Апельсин,Груша)
                                      i – его номер.
                                      arr – массив, который перебирается. */
  
    if (i in obj) {          // якщо 0 індекс в obj true (при першій ітерації false, бо obj пустий)
      obj[i] += 1;           // тоді в obj[i] додаємо 1
    } else {                 // інакше
      obj[i] = 1;            // присвоюємо 1 (що і відбудеться при першій ітерації)
    }
  });
  return obj; 
}
console.log(countBoxes('aaaaca31'))
//----------------Розв'язок ментора!!!-----------------

function countBoxes(boxes) { 
  const result = {};   // після першої ітерації result = {a: 0}

  for (const type of boxes) {  // boxes = "aaaaca31", перебір посимвольно
    if (!result[type]) {   // if not a true (а - перший символ, який попадає в type)
      result[type] = 0;   //  то беремо цей символ і присвоюємо йому 0, 
    }
    result[type]++; // якщо символ в циклі попадається повторно, виходимо з циклу, збільшуємо символ на 1
  }
  return result;
}

