/*Льотчики-випробувачі тестують нові літаки та піддають своє життя великому ризику. Для нас простих програмістів все набагато простіше. Ми теж можемо випробовувати щось і не ризикувати. Наприклад свої функції. Функції? Так функції, або якщо бути точнішим колбеки. Цікаво, який результат поверне той чи інший колбек з відповідними вхідними параметрами? Не біда. Створи для таких цілей функцію getResult, яка буде приймати callback функцію та масив params, для цього колбеку. Поверни результат виклику callback для елементів масиву params.

Приклад:
const sum = (a, b, c) =>  a + b + c;
getResult([4, 4, 1], sum); // === 9
getResult([10, 20, 30], sum); // === 60

const multiply = (a, b) => a * b;
getResult([3, 5], multiply); // === 15

const cube = x => x ** 3;
getResult([2], cube); // === 8

getResult([3, 7, 5, 1, 4], Math.min); // === 1
 */

const sum = (a, b, c) =>  a + b + c;

function getResult(params, callback) {
  const res = callback(...params);

  return res;
}

console.log(getResult([10, 20, 30], sum));